In [2]:
import psycopg2
import pandas as pd

DB_URL = "postgresql://rameen:Lc1CuAsGOfS0dvErr8F0LZtiPBr1PW7s@dpg-d4l3apfpm1nc738jaj50-a.virginia-postgres.render.com/mini_project2"

conn = psycopg2.connect(DB_URL)

query = "SELECT * FROM region;"
df = pd.read_sql(query, conn)
df

/tmp/ipykernel_1075/2780753172.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   regionid           region
0         1    British Isles
1         2  Central America
2         3   Eastern Europe
3         4    North America
4         5  Northern Europe
5         6      Scandinavia
6         7    South America
7         8  Southern Europe
8         9   Western Europe

In [2]:
import psycopg2
import pandas as pd

DB_URL = "postgresql://rameen:Lc1CuAsGOfS0dvErr8F0LZtiPBr1PW7s@dpg-d4l3apfpm1nc738jaj50-a.virginia-postgres.render.com/mini_project2"

conn = psycopg2.connect(DB_URL)
conn

In [3]:
pd.read_sql("SELECT * FROM region;", conn)

/tmp/ipykernel_333/3695526161.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM region;", conn)

   regionid           region
0         1    British Isles
1         2  Central America
2         3   Eastern Europe
3         4    North America
4         5  Northern Europe
5         6      Scandinavia
6         7    South America
7         8  Southern Europe
8         9   Western Europe

In [4]:
pd.read_sql("SELECT * FROM country LIMIT 10;", conn)

/tmp/ipykernel_333/2026836002.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM country LIMIT 10;", conn)

   countryid    country  regionid
0          1  Argentina         7
1          2    Austria         9
2          3    Belgium         9
3          4     Brazil         7
4          5     Canada         4
5          6    Denmark         5
6          7    Finland         6
7          8     France         9
8          9    Germany         9
9         10    Ireland         1

In [5]:
pd.read_sql("SELECT * FROM customer LIMIT 10;", conn)

/tmp/ipykernel_333/3824275659.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM customer LIMIT 10;", conn)

,customerid,firstname,lastname,address,city,countryid
0,1,Alejandra,Camino,"Gran Via, 1",Madrid,16
1,2,Alexander,Feuer,Heerstr. 22,Leipzig,9
2,3,Ana,Trujillo,Avda. de la Constitucion 2222,Mexico D.F.,12
3,4,Anabela,Domingues,"Av. Ines de Castro, 414",Sao Paulo,4
4,5,Andre,Fonseca,"Av. Brasil, 442",Campinas,4
5,6,Ann,Devon,35 King George,London,19
6,7,Annette,Roulet,1 rue Alsace-Lorraine,Toulouse,8
7,8,Antonio,Moreno,Mataderos 2312,Mexico D.F.,12
8,9,Aria,Cruz,"Rua Oros, 92",Sao Paulo,4
9,10,Art,Braunschweiger,P.O. Box 555,Lander,20

In [6]:
pd.read_sql("SELECT * FROM product LIMIT 10;", conn)

/tmp/ipykernel_333/501566702.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM product LIMIT 10;", conn)

,productid,productname,productunitprice,productcategoryid
0,1,Alice Mutton,39.00,6
1,2,Aniseed Syrup,10.00,2
2,3,Boston Crab Meat,18.40,8
3,4,Camembert Pierrot,34.00,4
4,5,Carnarvon Tigers,62.50,8
5,6,Chai,18.00,1
6,7,Chang,19.00,1
7,8,Chartreuse verte,18.00,1
8,9,Chef Anton's Cajun Seasoning,22.00,2
9,10,Chef Anton's Gumbo Mix,21.35,2

In [7]:
pd.read_sql("SELECT COUNT(*) FROM orderdetail;", conn)

/tmp/ipykernel_333/4290380641.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT COUNT(*) FROM orderdetail;", conn)

    count
0  621806

In [8]:
pd.read_sql("SELECT * FROM orderdetail LIMIT 10;", conn)

/tmp/ipykernel_333/3570870630.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM orderdetail LIMIT 10;", conn)

   orderid  customerid  productid   orderdate  quantityordered
0        1           1         68  2012-08-14                1
1        2           1         22  2012-08-14                6
2        3           1         66  2012-08-14                4
3        4           1         42  2012-08-15                6
4        5           1         53  2012-08-15                2
5        6           1         42  2012-09-16               10
6        7           1         49  2012-09-16               10
7        8           1         71  2012-09-16                5
8        9           1         42  2014-03-02                1
9       10           1          4  2014-03-02               10